# Space_AssignZone

## Description
Assign Zone to the space object.

```pascal
PROCEDURE Space_AssignZone(
				space    : HANDLE;
				zoneType : STRING;
				zoneName : STRING);
```

```python
def vs.Space_AssignZone(space, zoneType, zoneName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE|   |
|zoneType|STRING|   |
|zoneName|STRING|   |

## Version
Availability: from Vectorworks 2014

## Category
* SpaceObjectCoreTools